<?php

class Characters {

    /**
     * connection to database
     * @return object - for database connection
     */


    public static function removeDiacritics($string) {

        $translation = array('à'=>'a', 'á'=>'a', 'â'=>'a', 'ã'=>'a', 'ä'=>'a', 'å'=>'a', 'æ'=>'a', 
        'À'=>'A', 'Á'=>'A', 'Â'=>'A', 'Ã'=>'A', 'Ä'=>'A', 'Å'=>'A', 'Æ'=>'A',
        'ß'=>'B', 'ç'=>'c', 'Ç'=>'C', 'č' => 'c', 'Č' => 'C',
        'ď'=>'d', 'Ď'=>'d',
        'è'=>'e', 'é'=>'e', 'ê'=>'e', 'ë'=>'e',
        'È'=>'E', 'É'=>'E', 'Ê'=>'E', 'Ë'=>'E',
        'Ě'=>'E', 'ě'=>'ě',
        'ì'=>'i', 'í'=>'i', 'î'=>'i', 'ï'=>'i',
        'Ì'=>'I', 'Í'=>'I', 'Î'=>'I', 'Ï'=>'I',
        'ñ'=>'n', 'Ñ'=>'N',
        'ò'=>'o', 'ó'=>'o', 'ô'=>'o', 'õ'=>'o', 'ö'=>'o',
        'Ò'=>'O', 'Ó'=>'O', 'Ô'=>'O', 'Õ'=>'O', 'Ö'=>'O',
        'ř'=>'R', 'Ř'=>'R',
        'š'=>'s', 'Š'=>'S', 
        'Ť'=>'T', 'ť'=>'t',
        'ù'=>'u', 'ú'=>'u', 'û'=>'u', 'ü'=>'u',
        'Ù'=>'U', 'Ú'=>'U', 'Û'=>'U', 'Ü'=>'U',
        'ů'=>'u', 'Ů'=>'U',
        'ý'=>'y', 'Ý'=>'Y', 'ž'=>'z', 'Ž'=>'Z');

        return strtr($string, $translation);
    }

}